# Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
raitings_df = pd.read_csv('ml-latest-small/ratings.csv')
raitings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [36]:
df = (
    raitings_df[ ['movieId', 'rating'] ][ raitings_df['rating'] == 5.0 ]
    .groupby(by='movieId')
    .count()
    .sort_values(by='rating', ascending=False)
    .reset_index()
    .head(1)
)

In [4]:
movies_df = pd.read_csv('ml-latest-small/movies.csv')

In [37]:
df = (
    df.merge(movies_df, on='movieId')
    .rename(columns={'title' : 'Movie_title', 'rating': 'Num_of_5stars'})
    .reset_index()
)
df[ ['Movie_title', 'Num_of_5stars'] ]

                        Movie_title  Num_of_5stars
0  Shawshank Redemption, The (1994)            153

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [6]:
power_df = pd.read_csv('10._Основы_pandas/power.csv')
power_df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [7]:
power_df[ power_df['country'].str.contains('L|Es', case=True) ]['country'].unique()

array(['Lithuania', 'Lesotho', 'Latvia', 'Luxembourg', 'Estonia',
       "Lao People's Dem. Rep.", 'Liberia', 'Libya', 'Sri Lanka',
       'Sierra Leone', 'Lebanon', 'St. Lucia', 'Timor-Leste',
       'Liechtenstein'], dtype=object)

In [39]:
filtered_countries = (
    power_df[ ((power_df['country']=='Lithuania') | (power_df['country']=='Latvia')\
            | (power_df['country']=='Estonia'))\
            & ((power_df['year'] >= 2005) & (power_df['year'] <= 2010))\
            & ((power_df['category'] == 4) | (power_df['category'] == 12) | (power_df['category'] == 21))\
            & (power_df['quantity'] >= 0)]
    .sort_values(by='year', ascending=True)
    .reset_index()
)
filtered_countries.sample(20)

      index    country  year  quantity  category
85    19856    Estonia  2006       3.0         4
50   253566    Estonia  2005      31.0        21
397  206704  Lithuania  2010       0.0        21
239  221414    Estonia  2008      28.0        21
113  233319  Lithuania  2006    2471.0        21
18   243034     Latvia  2005    2132.0        21
163  118857  Lithuania  2007       3.0        12
329  215660     Latvia  2009    1536.0        21
339  228613  Lithuania  2009     220.0        21
218   11156  Lithuania  2008       1.0         4
62   217821  Lithuania  2006    1183.0        21
44    13297  Lithuania  2005       1.0         4
221   13294  Lithuania  2008       1.0         4
99    18220  Lithuania  2006       1.0         4
213  227714    Estonia  2008      29.0        21
254  218602  Lithuania  2008       0.0        21
268  204644     Latvia  2008       0.0        21
283  238505  Lithuania  2009     876.0        21
387  238504  Lithuania  2010     876.0        21
277  215743  Lithuania  2008     875.0        21

In [40]:
print(f'Cуммарное потребление стран Прибалтики составляет {int(filtered_countries["quantity"].sum())}')

Cуммарное потребление стран Прибалтики составляет 240580

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [54]:
page_url = 'https://fortrader.org/bankrates'
web_df = pd.read_html(page_url, attrs = {'class': 'items table table-striped table-bordered table-hover'}, encoding='utf-8')

In [56]:
web_df

[   Страна                                Банк  \
 0     NaN                   ЦБ РФ Банк России
 1     NaN    ЕЦБ Европейский Центральный Банк
 2     NaN   ФРС Федеральная Резервная Система
 3     NaN        РБА Резервный Банк Австралии
 4     NaN                     BOJ Банк Японии
 5     NaN  РБНЗ Резервный Банк Новой Зеландии
 6     NaN                  SNB Банк Швейцарии
 7     NaN                     BOC Банк Канады
 8     NaN                     BOE Банк Англии

                                          Название Значение  \
 0                                 Ключевая ставка     7.5%
 1                             Ставка по депозитам       2%
 2                              Федеральный Резерв       4%
 3                               Процентная ставка    2.85%
 4           Целевая процентная ставка по овернайт    -0.1%
 5                               Процентная ставка     3.5%
 6  Диапазон трехмесячной процентной ставки LIibor     0.5%
 7           Целевая процентная ставка по овернайт    3.25%
 8                               Процентная ставка       3%

   Последнее заседание Следующее заседание
 0  16.09.2022 (-0.5%)          28.10.2022
 1  27.10.2022 (0.75%)                 NaN
 2  02.11.2022 (0.75%)          14.12.2022
 3  01.11.2022 (0.25%)                 NaN
 4          28.10.2022                 NaN
 5   05.10.2022 (0.5%)                 NaN
 6  22.09.2022 (0.75%)                 NaN
 7  07.09.2022 (0.75%)          26.10.2022
 8  03.11.2022 (0.75%)                 NaN  ]